app/controllers/flits_controller.rb

  def create
    flit = current_user.flits.build(params[:flit])
    flit.message = flit.message[0..140]
    flit.created_at = Time.now
---
INSERT INTO `flits` (`created_at`, `updated_at`, `user_id`, `message`) VALUES('2010-10-15 04:31:31', '2010-10-15 04:31:31', 28, 'rajesh')