app/controllers/home_controller.rb

SELECT * FROM `flits` WHERE (`flits`.user_id = 28) ORDER BY flits.id DESC LIMIT 1
---
  def index
    @flits = current_user.all_flits
    @last_flits = current_user.flits.last

SELECT * FROM `users` WHERE (`users`.`username` = 'eldon') LIMIT 1
---
  def show
    @user = User.find_by_username(params[:username])

SELECT * FROM `users` WHERE (`users`.`username` = 'karthik') LIMIT 1
---
  def toggle_follow
    @user = User.find_by_username (params[:username])